# Importing Libraries

In [1]:
# importing libraries
# import libraries
import pandas as pd
import numpy as np
import os
# Importing df
df = pd.read_csv(r"C:\Users\Artemis07\Downloads\29-08-2023 Instacart Basket Analysis\02 Data\Original Data\orders.csv", index_col = False)
path = r"C:\Users\Artemis07\Downloads\29-08-2023 Instacart Basket Analysis"

In [2]:
#importing orders as df_ords & df_prods
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_clean.csv'), index_col = False)
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'prods_clean.csv'), index_col = False)

In [3]:
#importing orders_products_combined
df_ords_prods_combined = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

In [4]:
# 4. checking the shape of the imported dataframe
df_ords_prods_combined.shape

(32434489, 13)

In [5]:
# 5. Determine a suitable way to combine the ords_prods_combined df with your products data set. 
# We can combine ords_prods_combined df with products data set with the product_id as both set have it.

In [6]:
# Getting dimensions of df_prods
df_prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [7]:
#checking the output
df_ords_prods_combined.head()

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,0,0,2539329,1,prior,1,2,8,NaN,196,1,0,both
1,0,0,2539329,1,prior,1,2,8,NaN,14084,2,0,both
2,0,0,2539329,1,prior,1,2,8,NaN,12427,3,0,both
3,0,0,2539329,1,prior,1,2,8,NaN,26088,4,0,both
4,0,0,2539329,1,prior,1,2,8,NaN,26405,5,0,both

In [8]:
df_prods.shape

(49672, 6)

In [9]:
df_ords_prods_combined.shape

(32434489, 13)

In [10]:
# removing "unnamed" from df_ords_prods_combined as it is an unnecessary column 
df_ords_prods_combined = df_ords_prods_combined.drop(columns = ['Unnamed: 0.1', 'Unnamed: 0'])

In [11]:
df_ords_prods_combined = df_ords_prods_combined.drop(columns = ['_merge'])

In [12]:
# remove/drop "Unnamed" as it is an unneccessary column 
df_prods = df_prods.drop(columns = ['Unnamed: 0'])

In [13]:
df_ords_prods_combined.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered
0,2539329,1,prior,1,2,8,NaN,196,1,0
1,2539329,1,prior,1,2,8,NaN,14084,2,0
2,2539329,1,prior,1,2,8,NaN,12427,3,0
3,2539329,1,prior,1,2,8,NaN,26088,4,0
4,2539329,1,prior,1,2,8,NaN,26405,5,0

In [14]:
df_prods.shape

(49672, 5)

In [15]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [16]:
# 5. Determine a suitable way to combine the orders_products_combined df with your products data set. 
orders_products_combined = df_ords_prods_combined.merge(df_prods,on = 'product_id', indicator = True)

In [17]:
# 6. Confirm the results of the merge using the merge flag
orders_products_combined.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,prior,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,prior,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,prior,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,prior,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,prior,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

In [18]:
#checking the shape of the orders_products_combined df
orders_products_combined.shape

(32404859, 15)

In [19]:
# 7. Export the newly created dataframe as orders_products_merged in pickles format as it is quite a large data set. 
orders_products_combined.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged.pkl'))

In [20]:
orders_products_combined.columns

Index(['order_id', 'user_id', 'eval_set', 'order_number', 'order_dow',
       'order_hour_of_day', 'days_since_prior_order', 'product_id',
       'add_to_cart_order', 'reordered', 'product_name', 'aisle_id',
       'department_id', 'prices', '_merge'],
      dtype='object')